하나의 열: series(행에) 여러개의 열: dataframe(행에)

함수 -> 여러개가 모이면 모듈 -> 모듈이 모이면 라이브러리(패키지)

#모듈 사용하는법
1. import 라이브러리명(pandas)
- 사용)pandas.모듈

2. import 라이브러리명(pandas) as pd
- 사용) pd.모듈

3. from 라이브러리명 import 모듈(클래스명) (as 도 가능)

In [3]:
import pandas as pd #전체 모듈 사용
from pandas import Series,DataFrame #pandas중 2개사용

In [6]:
fruit= Series(data=[2500,3800,1200,6000],index=["apple","banana","peer","cherry"])
#pd.Series로 쓸수도있다.
#만약 index값을 주지않으면 default값으로 0부터 부여한다.
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [7]:
print(fruit.values) #array type으로 저장되어있음을 확인가능 =>index로 접근가능, dtype(데이터 타입=int)
print(fruit.index) #문자열이기때문에 dtype=object.

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [11]:
fruitData = {"a":2500,"b":3800,"c":1200,"d":6000}
fruit=Series(fruitData) #Series data로 만들기
type(fruitData)

dict

In [13]:
type(fruit)

pandas.core.series.Series

In [16]:
fruit.name = "fruitPrice" #이름을 줄 수 있음
fruit.index.name="fruitName" #index의 이름을 줄 수있음
fruit

fruitName
a    2500
b    3800
c    1200
d    6000
Name: fruitPrice, dtype: int64

dataframe 생성

In [21]:
fruitData={"fruitName":['apple','banana','cherry','peer'],"fruitPrice":[2500,3800,6000,1200],"num":[10,5,3,8]}
fruitData #여기까진 dictionary타입

{'fruitName': ['apple', 'banana', 'cherry', 'peer'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [23]:
pd.DataFrame(fruitData) #DataFrame type으로 변경. key가 column으로 가고 value가 column 밑으로 들어감
#dictonary는 행과열이 달라도 되나, dataframe은 행과열이 모두같아야 즉, value 개수가 다 같아야..

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [24]:
fruitFrame=pd.DataFrame(fruitData)

In [25]:
fruitData={"fruitName":['apple','banana','cherry','peer'],"fruitPrice":[2500,3800,6000,1200],"num":[10,5,3,8]}
#컬럼 순서를 내가 지정해줄수도 있다.
pd.DataFrame(fruitData,columns = ["fruitPrice","num","fruitName"])
#컬럼명을 없는값으로 줄 경우 해당 key가 없으므로 NaN 값이 들어온다.
# ex) pd.DataFrame(fruitData,columns = ["fruitPrice","num12","fruitName"])

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      peer

In [26]:
# column 이름을 가지고 해당 column 추출가능 => 결과: Series 형태다. (Series가 여러개 모여서 dataframe이 되기때문)
fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [27]:
#위와 같이 접근하는 다른방법 (결과는같다)
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [29]:
#컬럼추가하기 => dataframe["new컬럼명"] = 값

fruitFrame['year'] =2016
print(fruitFrame)

  fruitName  fruitPrice  num  year
0     apple        2500   10  2016
1    banana        3800    5  2016
2    cherry        6000    3  2016
3      peer        1200    8  2016

In [31]:
#df(dataframe) 컬럼추가, 다른데이터값으로 => Series 데이터를 만들어서 추가하기
variable = pd.Series([4,2,1],index=[0,2,3])
variable

0    4
2    2
3    1
dtype: int64

In [32]:
variable = pd.Series([4,2,1],index=[0,2,3]) #값이 없는거는 NaN이 뜬다.
fruitFrame["stock"] = variable #새로운 칼럼명을 주고 series를 할당함. (index 기준으로 할당됨을 알 수 있다.)
fruitFrame

  fruitName  fruitPrice  num  year  stock
0     apple        2500   10  2016    4.0
1    banana        3800    5  2016    NaN
2    cherry        6000    3  2016    2.0
3      peer        1200    8  2016    1.0

In [42]:
fruit= Series(data=[2500,3800,1200,6000],index=["apple","banana","peer","cherry"])
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [35]:
fruit.drop("banana") #drop할 key값을 넣어줌, 얘를 또 새로운 변수에 저장해서 쓸수는 있음.

apple     2500
peer      1200
cherry    6000
dtype: int64

In [43]:
fruit #drop만 썼을때는 결과는 보여주되, fruit값 자체(데이터)를 바꿔주진않음.

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [44]:
fruit.drop("banana",inplace=True) #결과값을 데이터에도 반영

In [45]:
fruit

apple     2500
peer      1200
cherry    6000
dtype: int64

In [49]:
#dataframe row 삭제하기 (index로)

fruitData={"fruitName":['apple','banana','cherry','peer'],"fruitPrice":[2500,3800,6000,1200],"num":[10,5,3,8]}
#dictionary에서 키값으로 데이터 추출
fruitName=fruitData["fruitName"]

#index는 data에서 가져올수없고 객체가 있어야 따로 지정해서 줄수있음.
fruitFrame=DataFrame(fruitData, index=fruitName, columns=["fruitPrice","num"]) #index에 fruitName을 줌.
# cf) DataFrame(fruitData,columns=["fruitName",fruitsPrice","num"])
fruitFrame

#apple,cherry 행을 삭제 <=이처럼 삭제하려는 값 여러개일경우 []리스트 구조로 값을 줘야함!
#cf. 한개만 지울경우 ""요렇게 주면됨
fruitFrame2 = fruitFrame.drop(["apple","cherry"])
fruitFrame2

        fruitPrice  num
banana        3800    5
peer          1200    8

In [50]:
#dataframe colum 삭제하기
fruitFrame3 = fruitFrame.drop("num",axis=1) #axis 값이 없으면 index를 기준(row단위)으로 가고 axis값을 주면 column 기준으로 값을찾아감
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [51]:
#얘도 마찬가지로 여러값을 지울경우 [] 리스트형태로 줘야한다.
fruitFrame.drop(["num","fruitPrice"],axis=1)

Empty DataFrame
Columns: []
Index: [apple, banana, cherry, peer]

In [52]:
fruit= Series(data=[2500,3800,1200,6000],index=["apple","banana","peer","cherry"])
#Series 항목 추출하기 => slice (index를 통해 범위 정해 추출)
fruit['apple':'peer']

apple     2500
banana    3800
peer      1200
dtype: int64

In [53]:
# dataframe 항목 추출하기
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

In [54]:
#컬럼을 slice => series 가 만들어짐
fruitFrame["fruitPrice"]

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [55]:
#컬럼을 여러개 slice => 리스트형태
fruitFrame[["fruitPrice","num"]]

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [59]:
#Series 연산
fruit1 = pd.Series([5,9,10,3],index=['ap','ba','ch','pe'])
fruit2 = pd.Series([3,2,9,5,10],index=['ap','or','ba','ch','ma'])
fruit1 + fruit2
#index로 연산을 해서 같은 index끼리 더하고 두개의 같은 index가 없으면 NaN를 반환.

ap     8.0
ba    18.0
ch    15.0
ma     NaN
or     NaN
pe     NaN
dtype: float64

In [62]:
#DataFrame 연산(dataframe내 index와 데이터값의 개수는 같아야한다.)
fruitData1={"Oh":[4,8,3,5],"Te":[0,1,2,3]}
fruitFrame1 = pd.DataFrame(fruitData1,columns=['Oh','Te'],index=['ap','ba','ch','pe'])

fruitData2={"Oh":[3,0,2,1,7],"Co":[5,4,3,6,0]}
fruitFrame2 = pd.DataFrame(fruitData2,columns=['Oh','Co'],index=['ap','or','ba','ch','ma'])

fruitFrame1+ fruitFrame2
#index와 column명이 있으면 더하나 둘중에 하나라도 빠지면 NaN으로 처리.

    Co    Oh  Te
ap NaN   7.0 NaN
ba NaN  10.0 NaN
ch NaN   4.0 NaN
ma NaN   NaN NaN
or NaN   NaN NaN
pe NaN   NaN NaN

In [64]:
#Series 정렬
fruit.sort_values(ascending=False) #()안에 안주면 값을 기준으로 오름차순정렬함.

cherry    6000
banana    3800
apple     2500
peer      1200
dtype: int64

In [66]:
#Dataframe 정렬
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [67]:
#index를 기준으로 정렬함. (내림차순)
fruitFrame.sort_index(ascending=False)

        fruitPrice  num
peer          1200    8
cherry        6000    3
banana        3800    5
apple         2500   10

In [71]:
#column을 정렬
fruitFrame.sort_index(axis=1)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [72]:
#flase주면 column 내림차순
fruitFrame.sort_index(axis=1, ascending=False)

        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200

In [74]:
#fruitPrice기준 정렬
fruitFrame.sort_values(by=["fruitPrice"])
#by=("")로 해도 됨

        fruitPrice  num
peer          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3

In [76]:
#기준을 여러개는 []로 묶어서 줘야
fruitFrame.sort_values(by=["num","fruitPrice"])

        fruitPrice  num
cherry        6000    3
banana        3800    5
peer          1200    8
apple         2500   10

In [77]:
fruitFrame.sort_values(by=["num"])
#뭐가다르지..

        fruitPrice  num
cherry        6000    3
banana        3800    5
peer          1200    8
apple         2500   10